In [2]:
import pandas as pd

In [14]:
df = pd.DataFrame(
{"a" : [4, 5, 6, 4],
"b" : [7, 8, 9, 9 ],
"c" : [10, 11, 12, 12]},
index = [1, 2, 3, 4])
df
#series 1차원 벡터

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  4  9  12

In [5]:
#dataFrame 2차원
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [7]:
#subset
df[df["a"] > 4]

   a  b   c
2  5  8  11
3  6  9  12

In [8]:
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [10]:
df[["a","b"]]

   a  b
1  4  7
2  5  8
3  6  9

In [15]:
df["a"].value_counts()

a
4    2
5    1
6    1
Name: count, dtype: int64

In [16]:
len(df)

4

In [21]:
df.sort_values("a", ascending=False )

   a  b   c
3  6  9  12
2  5  8  11
1  4  7  10
4  4  9  12

In [27]:
df = df.drop(["c"],axis=1)
df

   a  b
1  4  7
2  5  8
3  6  9
4  4  9

In [32]:
# group by 
df.groupby(["a"])["b"].agg(["mean","sum","count"])

   mean  sum  count
a
4   8.0   16      2
5   8.0    8      1
6   9.0    9      1

In [33]:
df.groupby(["a"])["b"].describe()

   count  mean       std  min  25%  50%  75%  max
a
4    2.0   8.0  1.414214  7.0  7.5  8.0  8.5  9.0
5    1.0   8.0       NaN  8.0  8.0  8.0  8.0  8.0
6    1.0   9.0       NaN  9.0  9.0  9.0  9.0  9.0

In [35]:
df

   a  b
1  4  7
2  5  8
3  6  9
4  4  9

In [38]:
pd.pivot_table(df, index="a", values="b", aggfunc="sum")

    b
a
4  16
5   8
6   9

In [40]:
df.plot.area